In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv('archive/basic1.csv')
df.tail()

       id    age city    f1  f2   f3    f4         f5
95   id96   92.0   경기  53.0   1  NaN  ENTJ  52.667078
96   id97  100.0   경기   NaN   0  NaN  INFP  67.886373
97   id98   39.0   경기  58.0   2  NaN  INFP  98.429899
98   id99    1.0   경기  47.0   0  NaN  ESFJ  97.381034
99  id100   47.0   경기  53.0   0  vip  ESFP  33.308999

In [3]:
top10 = df['f1'].sort_values(ascending=False).iloc[9]
print(top10)
df['f1'] = df['f1'].fillna(top10)

88.0

In [4]:
result1 = df['f1'].median()
result1

77.5

In [5]:
print(df.shape)

df = df.drop_duplicates(subset=['age'])
print(df.shape)

(100, 8)
(71, 8)

In [7]:
result2 = df['f1'].median()

print(result2)

77.0

In [8]:
print(abs(result1 - result2))

0.5